app/views/cards/_card.html.erb

    <p class="card-text ">
    <% @usercards = Card.where(user_id: user.id) %> <%= @usercards.count %> listed cards
---
SELECT COUNT(*) FROM "cards" WHERE "cards"."user_id" = $1  [["user_id", 1]]