app/controllers/accounts_controller.rb

SELECT "cards".* FROM "cards" WHERE "cards"."user_id" = $1  [["user_id", 1]]
---
    def show
        @cards = Card.where(user_id: @user.id)

SELECT "users".* FROM "users" WHERE "users"."name" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["name", "zan31"], ["LIMIT", 1]]
---
    def load_user
        @user = User.where(name: params[:id]).first