app/controllers/cards_controller.rb

SELECT "users".* FROM "users" WHERE (LOWER(name) like'%zan31%')
SELECT "cards".* FROM "cards" WHERE (LOWER(name) like'%dark magician%' OR Lower(print_tag) like'%dark magician%')
---
  def search
    @users = User.search(params[:keyword].downcase)
    @cards = Card.search(params[:keyword].downcase)

INSERT INTO "cards" ("print_tag", "name", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["print_tag", "SD6-EN003"], ["name", "Dark Magician"], ["price", 55.0], ["created_at", "2022-04-03 09:55:24.468839"], ["updated_at", "2022-04-03 09:55:24.468839"], ["user_id", 1]]
---
  def create
    @card = Card.new(card_params)
    @card.user = current_user

    respond_to do |format|
      if @card.save

UPDATE "cards" SET "set" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["set", "tole je pa long ass set name mkm"], ["updated_at", "2022-04-02 14:07:08.018376"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @card.update(card_params)