app/controllers/cards_imports_controller.rb

INSERT INTO "cards" ("print_tag", "name", "price", "psa", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["print_tag", "DP1-EN014"], ["name", "Polymerization"], ["price", 12.5], ["psa", true], ["created_at", "2022-05-02 10:55:20.165611"], ["updated_at", "2022-05-02 10:55:20.165611"], ["user_id", 2]]
---
  def create
    @cards_import = CardsImport.new(params[:cards_import])
    if @cards_import.save