app/controllers/cards_import.rb

  def load_imported_cards
    spreadsheet = open_spreadsheet
    header = spreadsheet.row(1)
    (2..spreadsheet.last_row).map do |i|
      row = Hash[[header, spreadsheet.row(i)].transpose]
      card = Card.find_by_id(row["id"]) || Card.new
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" IS NULL LIMIT $1  [["LIMIT", 1]]