app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]
---
  def index
    @favorites = Favorite.where(user_id: current_user)

INSERT INTO "favorites" ("print_tag", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["print_tag", "SYE-001"], ["created_at", "2022-04-03 17:56:54.888562"], ["updated_at", "2022-04-03 17:56:54.888562"], ["user_id", 1]]
---
  def create
    @favorite = Favorite.new(favorite_params)
    @favorite.user = current_user

    respond_to do |format|
      if @favorite.save

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_favorite
      @favorite = Favorite.find(params[:id])